[
  "\"For instance, on the planet Earth, man had always assumed that he was more intelligent than dolphins because he had achieved so much—the wheel, New York, wars and so on—whilst all the dolphins had ever done was muck about in the water having a good time. But conversely, the dolphins had always believed that they were far more intelligent than man—for precisely the same reasons.\"",
  "\"Don't Panic.\"",
  "\"Time is an illusion. Lunchtime doubly so.\"",
  "\"Would it save you a lot of time if I just gave up and went mad now?\"",
  "\"Isn't it enough to see that a garden is beautiful without having to believe that there are fairies at the bottom of it too?\"",
  "\"The ships hung in the sky in much the same way that bricks don't.\"",
  "\"He felt that his whole life was some kind of dream and he sometimes wondered whose it was and whether they were enjoying it.\"",
  "\"I'd far rather be happy than right any day.\"",
  "\"Space is big. You just won't believe how vastly, hugely, mind-bogglingly big it is. I mean, you may think it's a long way down the road to the chemist's, but that's just peanuts to space.\"",
  "\"If there's anything more important than my ego around, I want it caught and shot now.\"",
  "\"You know,\" said Arthur, \"it's at times like this, when I'm trapped in a Vogon airlock with a man from Betelgeuse, and about to die of asphyxiation in deep space that I really wish I'd listened to what my mother told me when I was young.\"\"Why, what did she tell you?\"\"I don't know, I didn't listen.\"",
  "\"For a moment, nothing happened. Then, after a second or so, nothing continued to happen.\"",
  "\"This must be Thursday,' said Arthur to himself, sinking low over his beer. 'I never could get the hang of Thursdays.\"",
  "\"Ford... you're turning into a penguin. Stop it.\"",
  "\"A towel, [The Hitchhiker's Guide to the Galaxy] says, is about the most massively useful thing an interstellar hitchhiker can have. Partly it has great practical value. You can wrap it around you for warmth as you bound across the cold moons of Jaglan Beta; you can lie on it on the brilliant marble-sanded beaches of Santraginus V, inhaling the heady sea vapors; you can sleep under it beneath the stars which shine so redly on the desert world of Kakrafoon; use it to sail a miniraft down the slow heavy River Moth; wet it for use in hand-to-hand-combat; wrap it round your head to ward off noxious fumes or avoid the gaze of the Ravenous Bugblatter Beast of Traal (such a mind-boggingly stupid animal, it assumes that if you can't see it, it can't see you); you can wave your towel in emergencies as a distress signal, and of course dry yourself off with it if it still seems to be clean enough.\"",
  "\"So this is it,\" said Arthur, \"We are going to die.\"\"Yes,\" said Ford, \"except... no! Wait a minute!\" He suddenly lunged across the chamber at something behind Arthur's line of vision. \"What's this switch?\" he cried.\"What? Where?\" cried Arthur, twisting round.\"No, I was only fooling,\" said Ford, \"we are going to die after all.\"",
  "\"This planet has - or rather had - a problem, which was this: most of the people living on it were unhappy for pretty much of the time. Many solutions were suggested for this problem, but most of these were largely concerned with the movement of small green pieces of paper, which was odd because on the whole it wasn't the small green pieces of paper that were unhappy.\"",
  "\"O Deep Thought computer,\" he said, \"the task we have designed you to perform is this. We want you to tell us....\" he paused, \"The Answer.\"\"The Answer?\" said Deep Thought. \"The Answer to what?\"\"Life!\" urged Fook.\"The Universe!\" said Lunkwill.\"Everything!\" they said in chorus.Deep Thought paused for a moment's reflection.\"Tricky,\" he said finally.\"But can you do it?\"Again, a significant pause.\"Yes,\" said Deep Thought, \"I can do it.\"\"There is an answer?\" said Fook with breathless excitement.\"Yes,\" said Deep Thought. \"Life, the Universe, and Everything. There is an answer. But, I'll have to think about it.\"...Fook glanced impatiently at his watch.\"How long?\" he said.\"Seven and a half million years,\" said Deep Thought.Lunkwill and Fook blinked at each other.\"Seven and a half million years...!\" they cried in chorus.\"Yes,\" declaimed Deep Thought, \"I said I'd have to think about it, didn't I?\"[Seven and a half million years later.... Fook and Lunkwill are long gone, but their descendents continue what they started]\"We are the ones who will hear,\" said Phouchg, \"the answer to the great question of Life....!\"\"The Universe...!\" said Loonquawl.\"And Everything...!\"\"Shhh,\" said Loonquawl with a slight gesture. \"I think Deep Thought is preparing to speak!\"There was a moment's expectant pause while panels slowly came to life on the front of the console. Lights flashed on and off experimentally and settled down into a businesslike pattern. A soft low hum came from the communication channel.\"Good Morning,\" said Deep Thought at last.\"Er..good morning, O Deep Thought\" said Loonquawl nervously, \"do you have...er, that is...\"\"An Answer for you?\" interrupted Deep Thought majestically. \"Yes, I have.\"The two men shivered with expectancy. Their waiting had not been in vain.\"There really is one?\" breathed Phouchg.\"There really is one,\" confirmed Deep Thought.\"To Everything? To the great Question of Life, the Universe and everything?\"\"Yes.\"Both of the men had been trained for this moment, their lives had been a preparation for it, they had been selected at birth as those who would witness the answer, but even so they found themselves gasping and squirming like excited children.\"And you're ready to give it to us?\" urged Loonsuawl.\"I am.\"\"Now?\"\"Now,\" said Deep Thought.They both licked their dry lips.\"Though I don't think,\" added Deep Thought. \"that you're going to like it.\"\"Doesn't matter!\" said Phouchg. \"We must know it! Now!\"\"Now?\" inquired Deep Thought.\"Yes! Now...\"\"All right,\" said the computer, and settled into silence again. The two men fidgeted. The tension was unbearable.\"You're really not going to like it,\" observed Deep Thought.\"Tell us!\"\"All right,\" said Deep Thought. \"The Answer to the Great Question...\"\"Yes..!\"\"Of Life, the Universe and Everything...\" said Deep Thought.\"Yes...!\"\"Is...\" said Deep Thought, and paused.\"Yes...!\"\"Is...\"\"Yes...!!!...?\"\"Forty-two,\" said Deep Thought, with infinite majesty and calm.\"",
  "\"Now it is such a bizarrely improbable coincidence that anything so mind-bogglingly useful could have evolved purely by chance that some thinkers have chosen to see it as the final and clinching proof of the non-existence of God.The argument goes something like this: \"I refuse to prove that I exist,'\" says God, \"for proof denies faith, and without faith I am nothing.\"\"But,\" says Man, \"The Babel fish is a dead giveaway, isn't it? It could not have evolved by chance. It proves you exist, and so therefore, by your own arguments, you don't. QED.\"\"Oh dear,\" says God, \"I hadn't thought of that,\" and promptly vanishes in a puff of logic.\"Oh, that was easy,\" says Man, and for an encore goes on to prove that black is white and gets himself killed on the next zebra crossing.\"",
  "\"The Answer to the Great Question... Of Life, the Universe and Everything... Is... Forty-two,' said Deep Thought, with infinite majesty and calm.\"",
  "\"So long, and thanks for all the fish.\"",
  "\"Anyone who is capable of getting themselves made President should on no account be allowed to do the job.\"",
  "\"One of the things Ford Prefect had always found hardest to understand about humans was their habit of continually stating and repeating the very very obvious.\"",
  "\"We demand rigidly defined areas of doubt and uncertainty!\"",
  "\"Far out in the uncharted backwaters of the unfashionable end of the western spiral arm of the Galaxy lies a small unregarded yellow sun. Orbiting this at a distance of roughly ninety-two million miles is an utterly insignificant little blue green planet whose ape-descended life forms are so amazingly primitive that they still think digital watches are a pretty neat idea.\"",
  "\"But the plans were on display…\"\"On display? I eventually had to go down to the cellar to find them.\"\"That's the display department.\"\"With a flashlight.\"\"Ah, well, the lights had probably gone.\"\"So had the stairs.\"\"But look, you found the notice, didn't you?\"\"Yes,\" said Arthur, \"yes I did. It was on display in the bottom of a locked filing cabinet stuck in a disused lavatory with a sign on the door saying ‘Beware of the Leopard.\"",
  "\"Did I do anything wrong today,\" he said, \"or has the world always been like this and I've been too wrapped up in myself to notice?\"",
  "\"All through my life I've had this strange unaccountable feeling that something was going on in the world, something big, even sinister, and no one would tell me what it was.\"\t\"No,\" said the old man, \"that's just perfectly normal paranoia. Everyone in the Universe has that.\"",
  "\"Ford!\" he said, \"there's an infinite number of monkeys outside who want to talk to us about this script for Hamlet they've worked out.\"",
  "\"Arthur: If I asked you where the hell we were, would I regret it?Ford: We're safe.Arthur: Oh good.Ford: We're in a small galley cabin in one of the spaceships of the Vogon Constructor Fleet.Arthur: Ah, this is obviously some strange use of the word safe that I wasn't previously aware of.\"",
  "\"Another thing that got forgotten was the fact that against all probability a sperm whale had suddenly been called into existence several miles above the surface of an alien planet.And since this is not a naturally tenable position for a whale, this poor innocent creature had very little time to come to terms with its identity as a whale before it then had to come to terms with not being a whale any more.This is a complete record of its thoughts from the moment it began its life till the moment it ended it.Ah … ! What's happening? it thought.Er, excuse me, who am I?Hello?Why am I here? What's my purpose in life?What do I mean by who am I?Calm down, get a grip now … oh! this is an interesting sensation, what is it? It's a sort of … yawning, tingling sensation in my … my … well I suppose I'd better start finding names for things if I want to make any headway in what for the sake of what I shall call an argument I shall call the world, so let's call it my stomach.Good. Ooooh, it's getting quite strong. And hey, what's about this whistling roaring sound going past what I'm suddenly going to call my head? Perhaps I can call that … wind! Is that a good name? It'll do … perhaps I can find a better name for it later when I've found out what it's for. It must be something very important because there certainly seems to be a hell of a lot of it. Hey! What's this thing? This … let's call it a tail – yeah, tail. Hey! I can can really thrash it about pretty good can't I? Wow! Wow! That feels great! Doesn't seem to achieve very much but I'll probably find out what it's for later on. Now – have I built up any coherent picture of things yet?No.Never mind, hey, this is really exciting, so much to find out about, so much to look forward to, I'm quite dizzy with anticipation …Or is it the wind?There really is a lot of that now isn't it?And wow! Hey! What's this thing suddenly coming towards me very fast? Very very fast. So big and flat and round, it needs a big wide sounding name like … ow … ound … round … ground! That's it! That's a good name – ground!I wonder if it will be friends with me?And the rest, after a sudden wet thud, was silence.Curiously enough, the only thing that went through the mind of the bowl of petunias as it fell was Oh no, not again. Many people have speculated that if we knew exactly why the bowl of petunias had thought that we would know a lot more about the nature of the universe than we do now.\"",
  "\"What's so unpleasant about being drunk?\"\"Ask a glass of water!\"",
  "\"Curiously enough, the only thing that went through the mind of the bowl of petunias as it fell was Oh no, not again. Many people have speculated that if we knew exactly why the bowl of petunias had thought that we would know a lot more about the nature of the Universe than we do now.\"",
  "\"In those days spirits were brave, the stakes were high, men were real men, women were real women and small furry creatures from Alpha Centauri were real small furry creatures from Alpha Centauri.\"",
  "\"Arthur blinked at the screens and felt he was missing something important. Suddenly he realized what it was.\"Is there any tea on this spaceship?\" he asked.\"",
  "\"I think you ought to know I'm feeling very depressed.\"",
  "\"The Hitch-Hiker's Guide to the Galaxy also mentions alcohol. It says that the best drink in existence is the Pan Galactic Gargle Blaster, the effect of which is like having your brains smashed out with a slice of lemon wrapped round a large gold brick.\"",
  "\"And then, one Thursday, nearly two thousand years after one man had been nailed to a tree for saying how great it would be to be nice to people for a change, a girl sitting on her own in a small café in Rickmansworth suddenly realized what it was that had been going wrong all this time, and she finally knew how the world could be made a good and happy place. This time it was right, it would work, and no one would have to get nailed to anything.\"",
  "\"The last ever dolphin message was misinterpreted as a surprisingly sophisticated attempt to do a double-backwards-somersault through a hoop whilst whistling the 'Star Spangled Banner', but in fact the message was this: So long and thanks for all the fish.\"",
  "\"One of the major difficulties Trillian experienced in her relationship with Zaphod was learning to distinguish between him pretending to be stupid just to get people off their guard, pretending to be stupid because he couldn't be bothered to think and wanted someone else to do it for him, pretending to be outrageously stupid to hide the fact that he actually didn't understand what was going on, and really being genuinely stupid. He was renowned for being amazingly clever and quite clearly was so—but not all the time, which obviously worried him, hence, the act. He preferred people to be puzzled rather than contemptuous.\"",
  "\"The bird that would soar above the plain of tradition and prejudice must have strong wings. \"",
  "\"Bypasses are devices that allow some people to dash from point A to point B very fast while other people dash from point B to point A very fast. People living at point C, being a point directly in between, are often given to wonder what's so great about point A that so many people from point B are so keen to get there, and what's so great about point B that so many people from point A are so keen to get there. They often wish that people would just once and for all work out where the hell they wanted to be.\"",
  "\"Perhaps I'm old and tired, but I always think that the chances of finding out what really is going on are so absurdly remote that the only thing to do is to say hang the sense of it and just keep yourself occupied.\"",
  "\"Meanwhile, the poor Babel fish, by effectively removing all barriers to communication between different races and cultures, has caused more and bloodier wars than anything else in the history of creation.\"",
  "\"Exactly!\" said Deep Thought. \"So once you do know what the question actually is, you'll know what the answer means.\"",
  "\"and we'll be saying a big hello to all intelligent life forms everywhere … and to everyone else out there, the secret is to bang the rocks together, guys.\"",
  "\"I don't want to die now!\" he yelled. \"I've still got a headache! I don't want to go to heaven with a headache, I'd be all cross and wouldn't enjoy it!\"",
  "\"Well, I mean, yes idealism, yes the dignity of pure research, yes the pursuit of truth in all its forms, but there comes a point I'm afraid where you begin to suspect that the entire multidimensional infinity of the Universe is almost certainly being run by a bunch of maniacs. And if it comes to a choice between spending yet another ten million years finding that out, and on the other hand just taking the money and running, then I for one could do with the exercise.\"",
  "\"My capacity for happiness,\" he added, \"you could fit into a matchbox without taking out the matches first\"",
  "\"The Ultimate Answer to Life, The Universe and Everything is...42!\"",
  "\"Ow! My brains!\"",
  "\"Vogon poetry is of course, the third worst in the universe. The second worst is that of the Azgoths of Kria. During a recitation by their poet master Grunthos the Flatulent of his poem \"Ode to a Small Lump of Green Putty I Found in My Armpit One Midsummer Morning\" four of his audience died of internal haemorrhaging and the president of the Mid-Galactic Arts Nobbling Council survived by gnawing one of his own legs off. Grunthos was reported to have been \"disappointed\" by the poem's reception, and was about to embark on a reading of his 12-book epic entitled \"My Favourite Bathtime Gurgles\" when his own major intestine, in a desperate attempt to save humanity, leapt straight up through his neck and throttled his brain. The very worst poetry of all perished along with its creator, Paul Neil Milne Johnstone of Redbridge, in the destruction of the planet Earth. Vogon poetry is mild by comparison.\"",
  "\"One of the things Ford Prefect had always found hardest to understand about human beings was their habit of continually stating and repeating the very very obvious, as in It's a nice day, or You're very tall, or Oh dear you seem to have fallen down a thirty-foot well, are you all right? At first Ford had formed a theory to account for this strange behaviour. If human beings don't keep exercising their lips, he thought, their mouths probably seize up. After a few months' consideration and observation he abandoned this theory in favour of a new one. If they don't keep on exercising their lips, he thought, their brains start working.\"",
  "\"Ford carried on counting quietly. This is about the most aggressive thing you can do to a computer, the equivalent of going up to a human being and saying \"Blood...blood...blood...blood...\"",
  "\"Hey, you sass that hoopy Ford Prefect? There's a frood who really knows where his towel is.\"(Sass: know, be aware of, meet, have sex with; hoopy: really together guy; frood: really amazingly together guy.)\"",
  "\"I like the cover,\" he said. \"Don't Panic. It's the first helpful or intelligible thing anybody's said to me all day.\"",
  "\"And all dared to brave unknown terrors, to do mighty deeds, to boldly split infinitives that no man had split before--and thus was the Empire forged.\"",
  "\"Sorry, did I say something wrong?\" said Marvin, dragging himself on regardless. \"Pardon me for breathing, which I never do anyway so I don't know why I bother to say it, oh God I'm so depressed. Here's another one of those self-satisfied doors. Life! Don't talk to me about life.\"",
  "\"Don't blame you,\" said Marvin and counted five hundred and ninety-seven thousand million sheep before falling asleep again a second later.\"",
  "\"The argument goes something like this: \"I refuse to prove that I exist,\" says God, \"for proof denies faith, and without faith I am nothing.\"",
  "\"...Something we once loved, and love now, in the shape of a book. Maybe eBooks are going to take over, one day, but not until those whizzkids in Silicon Valley invent a way to bend the corners, fold the spine, yellow the pages, add a coffee ring or two and allow the plastic tablet to fall open at a favorite page.\"",
  "\"I don't know what I'm looking for.\"\"What not?\"\"Because … because … I think it might be because if I knew I wouldn't be able to look for them.\"",
  "\"We'll be saying a big hello to all intelligent lifeforms everywhere and to everyone else out there, the secret is to bang the rocks together, guys.\"",
  "\"Looking up into the night sky is looking into infinity — distance is incomprehensible and therefore meaningless\"",
  "\"It is most gratifying,\" it said, \"that your enthusiasm for our planet continues unabated, and so we would like to assure you that the guided missiles currently converging with your ship are part of a special service we extend to all of our most enthusiastic clients, and the fully armed nuclear warheads are of course merely a courtesy detail. We look forward to your custom in future lives ... thank you.\"",
  "\"Here, for whatever reason, is the world. And here it stays. With me on it.\"",
  "\"So the hours are pretty good then?' he resumed.The Vogon stared down at him as sluggish thoughts moiled around in the murky depths.Yeah,' he said, 'but now you come to mention it, most of the actual minutes are pretty lousy.\"",
  "\"We are now cruising at a level of two to the power of twenty-five thousand to one against and falling, and we will be restoring normality just as soon as we are sure what is normal anyway.\"",
  "\"Very deep. You should send that in to the Reader's Digest. They've got a page for people like you.\"",
  "\"How do you feel?\" he asked him.\"Like a military academy,\" said Arthur. \"Bits of me keep on passing out.\"",
  "\"Far out in the uncharted backwaters of the unfashionable end of the Western spiral arm of the galaxy lies a small unregarded yellow sun. Orbiting this, at a distance of roughly ninety million miles is an utterly insignificant little blue-green planet, whose ape descended life forms are so amazingly primitive that they still think digital watches are a pretty neat idea. This planet has, or had, a problem, which was this. Most of the people living on it were unhappy for pretty much of the time. Many solutions were suggested for this problem, but most of these were largely concerned with the movements of small, green pieces of paper, which is odd, because on the whole, it wasn't the small, green pieces of paper which were unhappy. And so the problem remained, and lots of the people were mean, and most of them were miserable, even the ones with digital watches. Many were increasingly of the opinion that they'd all made a big mistake coming down from the trees in the first place, and some said that even the trees had been a bad move, and that no-one should ever have left the oceans. And then one day, nearly two thousand years after one man had been nailed to a tree for saying how great it would be to be nice to people for a change, a girl, sitting on her own in a small cafe in Rickmansworth suddenly realised what it was that had been going wrong all this time and she finally knew how the world could be made a good and happy place. This time it was right, it would work, and no-one would have to get nalied to anything. Sadly, however, before she could get to a phone to tell anyone, the Earth was unexpectedly demolished to make way for a new hyperspace bypass and so the idea was lost forever.\"",
  "\"The Hitchhiker's Guide to the Galaxy is an indispensable companion to all those who are keen to make sense of life in an infinitely complex and confusing Universe, for though it cannot hope to be useful or informative on all matters, it does at least make the reassuring claim, that where it is inaccurate it is at least definitively inaccurate. In cases of major discrepancy it's always reality that's got it wrong.This was the gist of the notice. It said \"The Guide is definitive. Reality is frequently inaccurate.\"This has led to some interesting consequences. For instance, when the Editors of the Guide were sued by the families of those who had died as a result of taking the entry on the planet Tralal literally (it said \"Ravenous Bugblatter Beasts often make a very good meal for visiting tourists: instead of \"Ravenous Bugblatter Beasts often make a very good meal of visiting tourists\"), they claimed that the first version of the sentence was the more aesthetically pleasing, summoned a qualified poet to testify under oath that beauty was truth, truth beauty and hoped thereby to prove that the guilty party in this case was Life itself for failing to be either beautiful or true. The judges concurred, and in a moving speech held that Life itself was in contempt of court, and duly confiscated it from all those there present before going off to enjoy a pleasant evening's ultragolf.\"",
  "\"There's no point in acting surprised about it. All the planning charts and demolition orders have been on display at your local planning department in Alpha Centauri for 50 of your Earth years, so you've had plenty of time to lodge any formal complaint and it's far too late to start making a fuss about it now. … What do you mean you've never been to Alpha Centauri? Oh, for heaven's sake, mankind, it's only four light years away, you know. I'm sorry, but if you can't be bothered to take an interest in local affairs, that's your own lookout. Energize the demolition beams.\"",
  "\"I only know as much about myself as my mind can work out under its current conditions. And its current conditions are not good.\"",
  "\"What, are you, crazy?' 'It's a possibility I haven't ruled out yet', said Zaphod quietly. 'I know as much about myself as my mind can work out under its current conditions. And its current conditions are not good.\"",
  "\"In many of the more relaxed civilizations on the Outer Eastern Rim of the Galaxy, the Hitch-Hiker's Guide has already supplanted the great Encyclopaedia Galactica as the standard repository of all knowledge and wisdom, for though it has many omissions and contains much that is apocryphal, or at least wildly inaccurate, it scores over the older, more pedestrian work in two important respects. First, it is slightly cheaper; and secondly it has the words DON'T PANIC inscribed in large friendly letters on its cover.\"",
  "\"...they discovered only a small asteroid inhabited by a solitary old man who claimed repeatedly that nothing was true, though he was later discovered to be lying.\"",
  "\"How many roads must a man walk down?\"",
  "\"And so the problem remained; lots of people were mean, and most were miserable, even the ones with digital watches.\"",
  "\"Do you find coming to terms with the mindless tedium of it all presents an interesting challenge?\"",
  "\"Come on,\" he droned, \"I've been ordered to take you down to the bridge. Here I am, brain the size of a planet and they ask me to take you down to the bridge. Call that job satisfaction? 'Cos I don't.\"He turned and walked back to the hated door.\"Er, excuse me,\" said Ford following after him, \"which government owns this ship?\"Marvin ignored him.\"You watch this door,\" he muttered, \"it's about to open again. I can tell by the intolerable air of smugness it suddenly generates.\"",
  "\"Marvin was humming ironically because he hated humans so much.\"",
  "\"It's unpleasantly like being drunk.\" \"What's so unpleasant about being drunk?\" \"You ask a glass of water.\"",
  "\"The President in particular is very much a figurehead — he wields no real power whatsoever. He is apparently chosen by the government, but the qualities he is required to display are not those of leadership but those of finely judged outrage. For this reason the President is always a controversial choice, always an infuriating but fascinating character. His job is not to wield power but to draw attention away from it. On those criteria Zaphod Beeblebrox is one of the most successful Presidents the Galaxy has ever had — he has already spent two of his ten presidential years in prison for fraud.\"",
  "\"It is an important and popular fact that things are not always what they seem. For instance, on the planet Earth, man had always assumed that he was more intelligent than dolphins because he had achieved so much, the wheel, New York, wars and so on - whilst all the dolphins had ever done was muck about in the water having a good time. But conversely, the dolphins had always believed that they were far more intelligent than man for precisely the same reasons…\"",
  "\"The President of the Universe holds no real power. His sole purpose is to take attention away from where the power truly exists...\"",
  "\"Who is this god person anyway?\"",
  "\"A towel, it says, is about the most massively useful thing an interstellar hitchhiker can have. Partly it has great practical value - you can wrap it around you for warmth as you bound across the cold moons of Jaglan Beta; you can lie on it on the brilliant marble-sanded beaches of Santraginus V, inhaling the heady sea vapours; you can sleep under it beneath the stars which shine so redly on the desert world of Kakrafoon; use it to sail a mini raft down the slow heavy river Moth; wet it for use in hand-to- hand-combat; wrap it round your head to ward off noxious fumes or to avoid the gaze of the Ravenous Bugblatter Beast of Traal (a mindboggingly stupid animal, it assumes that if you can't see it, it can't see you - daft as a bush, but very ravenous); you can wave your towel in emergencies as a distress signal, and of course dry yourself off with it if it still seems to be clean enough.More importantly, a towel has immense psychological value. For some reason, if a strag (strag: non-hitch hiker) discovers that a hitch hiker has his towel with him, he will automatically assume that he is also in possession of a toothbrush, face flannel, soap, tin of biscuits, flask, compass, map, ball of string, gnat spray, wet weather gear, space suit etc., etc. Furthermore, the strag will then happily lend the hitch hiker any of these or a dozen other items that the hitch hiker might accidentally have \"lost\". What the strag will think is that any man who can hitch the length and breadth of the galaxy, rough it, slum it, struggle against terrible odds, win through, and still knows where his towel is is clearly a man to be reckoned with.\"",
  "\"If they don't keep exercising their lips, he thought, their brains start working.\"",
  "\"What does it matter? Science has achieved some wonderful things, of course, but I'd far rather be happy than right any day.\"",
  "\"Mostly harmless\"",
  "\"It is of course perfectly natural to assume that everyone else is having a far more exciting time than you. Human beings, for instance, have a phrase that describes this phenomenon, ‘The other man's grass is always greener.'The Shaltanac race of Broopkidren 13 had a similar phrase, but since their planet is somewhat eccentric, botanically speaking, the best they could manage was, ‘The other Shaltanac's joopleberry shrub is always a more mauvy shade of pinky-russet.' And so the expression soon fell into disuse, and the Shaltanacs had little option but to become terribly happy and contented with their lot, much to the surprise of everyone else in the Galaxy who had not realized that the best way not to be unhappy is not to have a word for it.\"",
  "\"Nothing travels faster than the speed of light with the possible exception of bad news, which obeys its own special laws.\"",
  "\"I was created to fulfill a function and I failed in it. I negated my own existence.\"",
  "\"I think the problem, to be quite honest with you, is that you've never actually known what the question is.\"",
  "\"Trillian had come to suspect that the main reason [Zaphood] had had such a wild and successful life was that he never really understood the significance of anything he did.\"",
  "\"They wouldn't even lift a finger to save their own grandmothers from the Ravenous Bugblatter Beast of Traal without orders signed in triplicate, sent in, sent back, queried, lost, found, subjected to public inquiry, lost again, and finally buried in soft peat for three months and recycled as firelighters.\"",
  "\"What do you get if you multiply six by nine?\"\"Six by nine. Forty two.\"\"That's it. That's all there is.\"\"I always thought something was fundamentally wrong with the universe\"",
  "\"Was there a reason behind it? There would be no point in asking Zaphod, he never appeared to have a reason for anything he did at all: he had turned unfathomability into an art form. He attacked everything in life with a mixture of extraordinary genius and naive incompetence and it was often difficult to tell which was which.\"",
  "\"something almost, but not quite entirely unlike tea\"",
  "\"The deep roar of the ocean.The break of waves on farther shores that thought can find.The silent thunders of the deep.And from among it, voices calling, and yet not voices, humming trillings, wordlings, and half-articulated songs of thought.Greetings, waves of greetings, sliding back down into the inarticulate, words breaking together.A crash of sorrow on the shores of Earth.Waves of joy on--where? A world indescribably found, indescribably arrived at, indescribably wet, a song of water.A fugue of voices now, clamoring explanations, of a disaster unavertable, a world to be destroyed, a surge of helplessness, a spasm of despair, a dying fall, again the break of words.And then the fling of hope, the finding of a shadow Earth in the implications of enfolded time, submerged dimensions, the pull of parallels, the deep pull, the spin of will, the hurl and split of it, the fight. A new Earth pulled into replacement, the dolphins gone.Then stunningly a single voice, quite clear.\"This bowl was brought to you by the Campaign to Save the Humans. We bid you farewell.\"And then the sound of long, heavy, perfectly gray bodies rolling away into an unknown fathomless deep, quietly giggling.\"",
  "\"Fifteen years was a long time to be stranded anywhere, particularly somewhere as mind-boggingly dull as Earth.\"",
  "\"They've got as much sex appeal as a road accident.\"",
  "\"I'd far rather be happy than right any day.\"\"And are you?\" \"No. That's where it all falls down, of course.\"\"Pity\", said Arthur. \"It sounded like rather a good lifestyle otherwise.\"",
  "\"The Encyclopedia Galactica defines a robot as a mechanical apparatus designed to do the work of a man. The marketing division of the Sirius Cybernetics Corporation defines a robot as \"Your Plastic Pal Who's Fun to Be With. The Hitchhiker's Guide to the Galaxy defines the marketing devision of the Sirius Cybernetic Corporation as \"a bunch of mindless jerks who'll be the first against the wall when the revolution comes,\"",
  "\"I seem to be having tremendous difficulty with my life-style\"",
  "\"Forty-two!\" yelled Loonquawl. \"Is that all you've got to show for seven and a half million years' work?\" \"I checked it very thoroughly,\" said the computer, \"and that quite definitely is the answer. I think the problem, to be quite honest with you, is that you've never actually known what the question is.\"",
  "\"If somebody thinks they're a hedgehog, presumably you just give 'em a mirror and a few pictures of hedgehogs and tell them to sort it out for themselves.\"",
  "\"Ghastly,\" continued Marvin, \"it all is. Absolutely ghastly. Just don't even talk about it. Look at this door,\" he said, stepping through it. The irony circuits cut in to his voice modulator as he mimicked the style of the sales brochure. \" 'All the doors in his spaceship have a cheerful and sunny disposition. It is their pleasure to open for you, and their satisfaction to close again with the knowledge of a job well done.' \" As the door closed behind them it became apparent that it did indeed have a satisfied sighlike quality to it. \"Hummmmmmmyummmmmmmah!\" it said.\"",
  "\"Ford looked at him severely.And no sneaky knocking down Mr Dent's house whilst he's away, alright?\" he said.The mere thought,\" growled Mr Prosser, \"hadn't even begun to speculate,\" he continued, settling himself back, \"about the merest possibility of crossing my mind.\"",
  "\"A computer chatted to itself in alarm as it noticed an airlock open and close itself for no apparent reason.This was because Reason was in fact out to lunch.\"",
  "\"Hey, this is terrific!\" he said. \"Someone down there is trying to kill us!\"\"Terrific,\" said Arthur.\"But don't you see what this means?\"\"Yes. We are going to die.\"\"Yes, but apart from that.\"\"Apart from that?!\"\"It means we must be on to something!\"\"How soon can we get off it?\"",
  "\"There was a terribly ghastly silence.There was a terribly ghastly noise.There was a terribly ghastly silence.\"",
  "\"Perhaps I'm old and tired, but I think that the chances of finding out what's actually going on are so absurdly remote that the only thing to do is to say, \"Hang the sense of it,\" and keep yourself busy. I'd much rather be happy than right any day.\"",
  "\"The Heart of Gold fled on silently through the night of space, now on conventional photon drive. Its crew of four were ill as ease knowing that they had been brought together not of their own volition or by simple coincidence, but by some curious perversion of physics- as if relationships between people were susceptible to the same laws that governed the relationships between atoms and molecules\"",
  "\"There are of course many problems connected with life, of which some of the most popular are Why are people born? Why do they die? Why do they want to spend so much of the intervening time wearing digital watches?\"",
  "\"Space,\" it says, \"is big. Really big. You just won't believe how vastly, hugely, mindbogglingly big it is. I mean, you may think it's a long way down the road to the chemist's, but that's just peanuts to space, listen...\"",
  "\"He's spending a year dead for tax reasons.\"",
  "\"Zaphod marched quickly down the passageway, nervous as hell, but trying to hide it by striding purposefully.\"",
  "\"Well the hours are good...' ... 'but now you come to mention it, most of the actual minutes are pretty lousy.\""
]